In [1]:
pip install pandas

Requirement already satisfied: pandas in d:\anaconda_setup\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in d:\anaconda_setup\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\anaconda_setup\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda_setup\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in d:\anaconda_setup\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in d:\anaconda_setup\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

**For EDA we use**
- Pandas -> used for data frame applications
- Numpy  -> Numerical python/ Numerical analysis. All math applications
- Matplitlib -> used for plotting
- Seaborn -> used for plot
- Plotly, Bokhe  -> used for plot

**Machine Learning**
- Sickit-learn -> sklearn

**Deep Learning**
- Tensorflow -> Google developed
- Keras -> Google
- Pytorch -> Facebook

**NLP(Natural Language Processing)**
- NLTK -> Natural Language Tool Kit
- Scipy

**BERT (Bi-directional Encoded Representation Transformers)**
- Transformers -> Developed by Hugging Face take over by Google

**Google Models**
- Specific Google Packages

**Azure ML**
- Azure Packages

**GenAI**
- Gemini AI -> Google
- ChatGPT -> OpenAI

**LangChain**
- LangChain packages

$Step$-$1$

**Create a DataFrame**

In [1]:
import pandas as pd
names=['Zoro', 'Luffy','Akaza']
pd.DataFrame() # Empty dataframe

Empty DataFrame
Columns: []
Index: []

$Step$-$2$ 

**Provide the Data**

In [2]:
names=['Zoro', 'Luffy','Akaza']
pd.DataFrame(names)

       0
0   Zoro
1  Luffy
2  Akaza

In [4]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
pd.DataFrame(names,age) # It is taking age as index

        0
20   Zoro
25  Luffy
30  Akaza

In [3]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
pd.DataFrame(zip(names,age))
# first positional argument: data
# second positional argument: index

       0   1
0   Zoro  20
1  Luffy  25
2  Akaza  30

In [6]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city))

       0   1        2
0   Zoro  20      hyd
1  Luffy  25      blr
2  Akaza  30  chennai

In [7]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age),city)

             0   1
hyd       Zoro  20
blr      Luffy  25
chennai  Akaza  30

$Step$-$3$:

**Provide the Column names**

In [4]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
pd.DataFrame(zip(names,age),
             columns=['Names','Age']) # By giving columns the name is changing

   Names  Age
0   Zoro   20
1  Luffy   25
2  Akaza   30

In [6]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
city=['hyd','blr','chennai']
df=pd.DataFrame(zip(names,age,city),
             columns=['Names','Age','City'])

In [15]:
type(df)

pandas.core.frame.DataFrame

$Step$-$4$:
**Add new Column**

- If you want to add new column 
- First you need to check the no of rows in already existed data
- For Eg: in above DataFrame has 3 rows
- You need to create a new list with 3 rows
- That list equate to the DataFrame

In [7]:
job=['DS','DE','CS']
df['JOB']=job # Giving a new column
df

   Names  Age     City JOB
0   Zoro   20      hyd  DS
1  Luffy   25      blr  DE
2  Akaza   30  chennai  CS

$Step$-$5$:

**Update Existing Column**

In [8]:
df['Age']=[35,40,50] # Changing existed column
df

   Names  Age     City JOB
0   Zoro   35      hyd  DS
1  Luffy   40      blr  DE
2  Akaza   50  chennai  CS

$Step$-$6$:

**Change the Index**

In [20]:
df

   Names  Age     City JOB  AGE
0   Zoro   35      hyd  DS   35
1  Luffy   40      blr  DE   40
2  Akaza   50  chennai  CS   50

In [23]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
city=['hyd','blr','chennai']
df=pd.DataFrame(zip(names,age,city), index=['A','B','C'],
             columns=['Names','Age','City'])
df

   Names  Age     City
A   Zoro   20      hyd
B  Luffy   25      blr
C  Akaza   30  chennai

**Note**
- No of list == No of columns
- No of values in list == No of rows
- When you create the data all the list will be in same length

$Step$-$7$:

**Shape**

- No of rows & No of columns

In [25]:
df.shape # Matrix format --> 3 rows, 3 columns

print(f"The no of rows ={df.shape[0]}")

The no of rows =3

$Step$-$8$:

**Drop the Column**

- In order to drop a column require 3 arguments
    - Column name
    - Axis: 
        - Axis=0 --> **represent rows**     
        - Axis=1 --> **represent columns**
    - Inplace: Dropping column means modifying the DataFrame
        - This modification can be saved in **same variable (inplace=True)** or different variable

In [27]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
city=['hyd','blr','chennai']
df=pd.DataFrame(zip(names,age,city), index=['A','B','C'],
             columns=['Names','Age','City'])
df

   Names  Age     City
A   Zoro   20      hyd
B  Luffy   25      blr
C  Akaza   30  chennai

In [30]:
df.drop('City',axis=1,inplace=True)
df

   Names  Age
A   Zoro   20
B  Luffy   25
C  Akaza   30

In [33]:
df1=df.drop('Age',axis=1)
df # if inplace=True is not there then the column will not change in that variable

   Names  Age
A   Zoro   20
B  Luffy   25
C  Akaza   30

In [34]:
df1

   Names
A   Zoro
B  Luffy
C  Akaza

$Step$-$9$:

**Multiple Columns Drop**

In [35]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
city=['hyd','blr','chennai']
df=pd.DataFrame(zip(names,age,city), index=['A','B','C'],
             columns=['Names','Age','City'])
df

   Names  Age     City
A   Zoro   20      hyd
B  Luffy   25      blr
C  Akaza   30  chennai

In [36]:
df.drop(['Age','City'], axis=1,inplace=True)
df

   Names
A   Zoro
B  Luffy
C  Akaza

$Step$-$10$:

**Drop The Rows**

In [37]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
city=['hyd','blr','chennai']
df=pd.DataFrame(zip(names,age,city), index=['A','B','C'],
             columns=['Names','Age','City'])
df

   Names  Age     City
A   Zoro   20      hyd
B  Luffy   25      blr
C  Akaza   30  chennai

In [38]:
df.drop('A',axis=0,inplace=True)
df

   Names  Age     City
B  Luffy   25      blr
C  Akaza   30  chennai

In [39]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
city=['hyd','blr','chennai']
df=pd.DataFrame(zip(names,age,city), index=['A','B','C'],
             columns=['Names','Age','City'])
df

   Names  Age     City
A   Zoro   20      hyd
B  Luffy   25      blr
C  Akaza   30  chennai

In [40]:
df.drop(['A','B'],axis=0,inplace=True)
df

   Names  Age     City
C  Akaza   30  chennai

$Step$-$11$:

**How to save the DataFrame**

- Generally DataFrames are 2 types:
    - csv (Comma Separated Value)
    - excel

In [41]:
names=['Zoro', 'Luffy','Akaza']
age=[20,25,30]
city=['hyd','blr','chennai']
df=pd.DataFrame(zip(names,age,city), index=['A','B','C'],
             columns=['Names','Age','City'])
df

   Names  Age     City
A   Zoro   20      hyd
B  Luffy   25      blr
C  Akaza   30  chennai

In [47]:
# File name=data
# Extension: .csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [46]:
df.to_excel('data2.xlsx',index=False)

$For$ $Article$

In [1]:
import pandas as pd
names=['Lohith','Hari','Bunny']
pd.DataFrame(names)

        0
0  Lohith
1    Hari
2   Bunny

In [4]:
import pandas as pd
names=['Lohith','Hari','Bunny']
age=[20,25,19]
pd.DataFrame(zip(names,age),columns=['Name','Age']) # It is taking age as index

     Name  Age
0  Lohith   20
1    Hari   25
2   Bunny   19

In [6]:
import pandas as pd
dict={'Names':['Lohith','Hari','Bunny'],
'Age':[20,25,19]}
df = pd.DataFrame(dict)
df

    Names  Age
0  Lohith   20
1    Hari   25
2   Bunny   19

In [7]:
df['Job']=['DE','WD','DS']
df

    Names  Age Job
0  Lohith   20  DE
1    Hari   25  WD
2   Bunny   19  DS

In [10]:
d1={'Job':['DE','WD','DS']}
pd.DataFrame(zip(dict,d1))

       0    1
0  Names  Job

In [11]:
import pandas as pd
dict={'Names':['Lohith','Hari','Bunny'],
'Age':[20,25,19],
'City':['Hyd','Chennai','USA']}
df = pd.DataFrame(dict)
# Add new column to the above df
job=['Data Engineer','Software Developer','Data Scientist']
df['Job']=job # Assigning Job as column name and list as values
df

    Names  Age     City                 Job
0  Lohith   20      Hyd       Data Engineer
1    Hari   25  Chennai  Software Developer
2   Bunny   19      USA      Data Scientist

In [12]:
import pandas as pd
dict={'Names':['Lohith','Hari','Bunny','Venkat Rao'],
'Age':[20,25,19,20],
'City':['Hyd','Chennai','USA','Hyd'],
'Job':['Data Engineer','Software Developer','Data Scientist','Programmer']}
df = pd.DataFrame(dict)
df['Age']=[25,30,20,19]
df

        Names  Age     City                 Job
0      Lohith   25      Hyd       Data Engineer
1        Hari   30  Chennai  Software Developer
2       Bunny   20      USA      Data Scientist
3  Venkat Rao   19      Hyd          Programmer

In [13]:
import pandas as pd
dict={'Names':['Lohith','Hari','Bunny','Venkat Rao'],
'Age':[20,25,19,20], # initial age values
'City':['Hyd','Chennai','USA','Hyd'],
'Job':['Data Engineer','Software Developer','Data Scientist','Programmer']}
df = pd.DataFrame(dict,index=['A','B','C','D'])
df

        Names  Age     City                 Job
A      Lohith   20      Hyd       Data Engineer
B        Hari   25  Chennai  Software Developer
C       Bunny   19      USA      Data Scientist
D  Venkat Rao   20      Hyd          Programmer

In [19]:
import pandas as pd
dict={'Names':['Lohith','Hari','Bunny','Venkat Rao'],
'Age':[20,25,19,20], # initial age values
'City':['Hyd','Chennai','USA','Hyd'],
'Job':['Data Engineer','Software Developer','Data Scientist','Programmer']}
df = pd.DataFrame(dict,index=['A','B','C','D'])

# Dropping City column
df.drop('City',axis=1,inplace=True)
df

        Names  Age                 Job
A      Lohith   20       Data Engineer
B        Hari   25  Software Developer
C       Bunny   19      Data Scientist
D  Venkat Rao   20          Programmer

In [20]:
import pandas as pd
dict={'Names':['Lohith','Hari','Bunny','Venkat Rao'],
'Age':[20,25,19,20], # initial age values
'City':['Hyd','Chennai','USA','Hyd'],
'Job':['Data Engineer','Software Developer','Data Scientist','Programmer']}
df = pd.DataFrame(dict,index=['A','B','C','D'])

# Dropping City, Age columns
df.drop(['Age','City'],axis=1,inplace=True)
df

        Names                 Job
A      Lohith       Data Engineer
B        Hari  Software Developer
C       Bunny      Data Scientist
D  Venkat Rao          Programmer

In [21]:
import pandas as pd
dict={'Names':['Lohith','Hari','Bunny','Venkat Rao'],
'Age':[20,25,19,20], # initial age values
'City':['Hyd','Chennai','USA','Hyd'],
'Job':['Data Engineer','Software Developer','Data Scientist','Programmer']}
df = pd.DataFrame(dict,index=['A','B','C','D'])

# Dropping Age, City columns
df.drop(['A','C'],axis=0,inplace=True)
df

        Names  Age     City                 Job
B        Hari   25  Chennai  Software Developer
D  Venkat Rao   20      Hyd          Programmer